nc: 80
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 2, C3k2, [256, False, 0.25]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, OptimizedMOEImproved, [512, 4, 2]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 4, DyC2f, [512, 4, 2, 0.5]]  # replace A2C2f with DyC2f (num_experts=4, top_k=2, e=0.5)
  - [-1, 1, OptimizedMOEImproved, [512, 4, 2]]

  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 4, DyC2f, [1024, 8, 2, 0.5]]  # deeper stage with more experts
  - [-1, 1, OptimizedMOEImproved, [1024, 8, 2]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [[18, 21, 24], 1, Detect, [nc]]
