# YOLO12-MoE-Dynamic (Final Optimized Version)
# 针对训练指标下降进行了结构修正：增强了基础层，优化了路由感知

nc: 80 
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]

backbone:
  # --- Stage 1: P1/P2 极浅层 (保持标准卷积) ---
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C3k2, [256, False, 0.25]] # 2-P2: 保持足够深度

  # --- Stage 2: P3 浅层 (引入动态调制，增强小目标感应) ---
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C3k2_Dynamic, [512, False, 0.25]] # 4: 增加 repeats 到 6，强化特征提取

  # --- Stage 3: P4 中层 (LSKA 感知 + MoE 容量) ---
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 1, C2f_LSKA, [512, True]] # 6: LSKA 替代 A2C2f，为 MoE 提供大感受野引导
  - [-1, 1, OptimizedMOEImproved, [512, 4, 2]] # 7: 中层 4 专家

  # --- Stage 4: P5 深层 (极致扩容) ---
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32
  - [-1, 1, C2f_LSKA, [1024, True]] # 9: 深层全局信息捕捉
  - [-1, 1, OptimizedMOEImproved, [1024, 8, 2]] # 10: 深层 8 专家，Top2 激活


head:
  # ... (头部保持不变)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2_Dynamic, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2_Dynamic, [512, True]]

  - [[16, 19, 22], 1, Detect, [nc]]
