# YOLO-Master v0.11 🚀 AGPL-3.0 License
# ──────────────────────────────────────────────────────────────────────────────
# Experiment v0_11-B2: Temperature Ablation (temperature=0.5 → sharper routing)
#
# Architecture: v0_5 FusedAdaptiveGateMoE, identical structure.
# Only change: moe_temperature=0.5 (was 1.0 default).
#
# Hypothesis (B2): Lower temperature sharpens the softmax distribution over
# experts, encouraging more decisive routing. At initial_temperature=0.5,
# final_temperature=0.25 the router converges faster to specialized paths.
# Risk: too-sharp routing early in training can cause premature expert collapse.
# Mitigation: moe_balance_loss=0.1 + variance_loss=0.01 counteract collapse.
#
# This is a hyperparameter-only experiment — no architecture file changes needed.
# Run via overrides:
#   yolo detect train \
#     model=ultralytics/cfg/models/master/v0_5/det/yolo-master-n.yaml \
#     data=VOC.yaml epochs=50 imgsz=640 batch=16 \
#     moe_temperature=0.5 moe_balance_loss=0.1 moe_variance_loss=0.01
#
# The yaml below explicitly sets initial/final temperature via args to ensure
# they are always overridden even if model defaults differ.
# ──────────────────────────────────────────────────────────────────────────────

nc: 80
scales:
  n: [0.50, 0.25, 1024]

# B2 note: temperature overrides happen at trainer level via moe_temperature=0.5
# This YAML is intentionally identical to v0_5 — temperature is injected by trainer
backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]

  # initial_temperature=0.5, final_temperature=0.25 (args[6] and args[7])
  - [-1, 1, FusedAdaptiveGateMoE, [512, 4, 2, 0.5, 8, 0.5, 0.25]]  # 5

  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 4, A2C2f, [512, True, 4]]

  - [-1, 1, FusedAdaptiveGateMoE, [512, 8, 2, 0.5, 8, 0.5, 0.25]]  # 8

  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 4, A2C2f, [1024, True, 1]]

  - [-1, 1, FusedAdaptiveGateMoE, [1024, 16, 2, 0.5, 8, 0.5, 0.25]] # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]

  - [[17, 20, 23], 1, Detect, [nc]]
